import 'package:flutter/material.dart';

class Article {
  final int id;
  final String title;
  final String body;
  final String image;
  final String category;
  final Color color;

  Article({
    required this.id,
    required this.title,
    required this.body,
    required this.image,
    required this.category,
    required this.color,
  });

  static List<Article> articles = [
    Article(
      id: 1,
      title: 'الصحّة والغذاء',
      body:
          'ترتبط الصحّة ارتباطاً مباشراً بالغذاء، فالتغذية السليمة، أساس الصحّة السليمة، لأنّ الغذاء هو الداء والدواء معاً، لذلك يجب على كل شخصٍ أن ينتبه لنوعيّة الطعام الذي يتناوله؛ لأنّ صحّة الجسم تعتمد على المجموعات الغذائيّة الأساسيّة التي تدخل إليه عن طريق الغذاء، كي يستطيع أن يقوم بمهامّه جميعاً، ويتمكن من إنتاج الطاقة، وهذه المجموعات هي مجموعة الفيتامينات، ومضادات الأكسدة، والمعادن، بالإضافة للبروتينات، والكربوهيدرات، والسكريات، والدهون.[١] كما أنّ صحّة جميع أعضاء الجسم، والتناغم الحاصل بينها، يعتمد على توازن المواد الأساسيّة التي يكتسبها من الغذاء الذي يتم تناوله، وهنا في هذا المقال سنذكر بعض النصائح ليبقَ الجسم قويّاً في مواجهة الأمراض',
      image: 'assets/assets/icons/png/1.png',
      category: 'تغذية',
      color: Color(0xFFB4cf66),
    ),

    Article(
      id: 2,
      title: 'أطعمة لتحسين المزاج',
      body:
          'يوجد عِدة أطعمة تُحسّن المزاج وتُقلل من الاكتئاب ومنها:[١] المكسرات: تتميّز المُكسرات بِأنها غنية بالعناصر الغذائيّة وأهمها الألياف، والبروتين، والدهون الصحيّة مثل أوميغا3. ويُنصح بتناول أونصة واحدة أي ما يعادل 28 غرماً يومياً من المكسرات التي تحتوي على اللوز والجوز. لحوم الأبقار التي تتغذى على الأعشاب: تحتوي هذه اللحوم على عناصر غذائية عديدة أهمها البروتين الصحيّ عالي الجودة والدهون الصحيّة مثل الأوميغا3، التي تلعب دوراً في تقليل الاكتئاب وتحسين المزاج. الأسماك: يُعتبر السمك من أفضل الأغذية التي تُحارب الاكتئاب؛ لاحتوائها على مواد تحمل خصائص كمضادات للاكتئاب، ويُنصح بتناول 3 أونصات أي ما يُعادل 85 غراماً من السمك مرتين إلى 3 مرات خلال الإسبوع. الحبوب الكاملة: تُعتبر الحبوب الكاملة من الأطعمة الغنيّة بالألياف الغذائيّة؛ وذلك لدورها المهم في توازن معدلات السكر في الدم و تحسين المزاج عن طريق تنظيم إفراز النواقل العصبيّة في الدّماغ، لذا يُنصح بتناول 25 غراماً من الألياف للنساء و38 غراماً للرجال يوميّاً. الفواكة: يقل خطر الإصابة بالاكتئاب كُلّما زاد تناول الفواكة، وذلك بسبب احتوائها على العديد من الفيتامينات والمعادن. لِذا يُنصح بتناول نصف كوب إلى كوبين من الفواكة يوميّاً.',
      image: 'assets/assets/icons/png/2.png',
      category: 'تغذية',
      color: Color(0xFFB4cf66),
    ),

    Article(
      id: 3,
      title: 'استراتيجيات للوقاية من مرض القلب',
      body: '''
أمراض القلب هي السبب الرئيسي للوفاة. ولا يمكنك تغيير بعض عوامل الخطورة، مثل السيرة المرَضية للعائلة أو نوع الجنس عند الولادة أو العمر. لكن هناك العديد من الخطوات الأخرى التي يمكنك من خلالها تقليل خطر الإصابة بأمراض القلب.

ابدأ بهذه النصائح الثماني لتعزيز صحة قلبك:

1. لا ينبغي التدخين أو استخدام منتجات التبغ
أحد أفضل الأشياء التي يمكنك القيام بها من أجل قلبك هو التوقف عن التدخين أو استخدام تبغ بدون دخان. حتى لو لم تكن مدخنًا، فاحرص على تجنب التدخين السلبي.

حيث يمكن أن تلحق المواد الكيميائية الموجودة في التبغ الضرر بالقلب والأوعية الدموية. يُقلِل دخان السجائر من الأكسجين الموجود في الدم، مما يرفع ضغط الدم وسرعة القلب؛ إذ يضطر القلب إلى العمل بشكل أقوى لضخ كمية كافية من الأكسجين للجسم والدماغ.

لكن هناك أخبار جيدة رغم ذلك. يبدأ خطر الإصابة بمرض القلب في الانخفاض في أقل من يوم واحد بعد الإقلاع عن التدخين. فبعد عام من الإقلاع عن التدخين، ينخفض خطر الإصابة بمرض القلب إلى حوالي نصف الخطر المُعرض له الشخص المُدخِن. وأيًا كانت المدة التي أمضيتَها في التدخين أو مقدار ما دخنته، فستبدأ في جني الثمار بمجرد الإقلاع عنه.

2. تحرَّك: فليكن هدفك هو ممارسة النشاط لمدة 30 إلى 60 دقيقة على الأقل يوميًّا
يمكن أن تقلل الأنشطة البدنية اليومية المنتظمة من خطر الإصابة بأمراض القلب. كما تساعد الأنشطة البدنية في التحكم في الوزن. وتقلل أيضًا من احتمالات الإصابة بحالات مرَضية أخرى قد تسبب إجهادًا للقلب، مثل ارتفاع ضغط الدم وارتفاع الكوليسترول والإصابة بداء السكري من النوع الثاني.
''',
      image: 'assets/assets/icons/png/3.png',
      category: "صحة",
      color: Color(0xFF79bde8),
    ),
    Article(
      id: 4,
      title: 'فوائد الزنجبيل مع الليمون والعسل ',
      body: '''
فوائد الزنجبيل مع الليمون والعسل
تنبثق فوائد الزنجبيل مع الليمون والعسل من مكونات كل واحد منها، ومن أبرز الفوائد ما يلي:
1. فوائد الزنجبيل:
- محاربة الجراثيم: تُساعد مركبات الزنجبيل على قتل الجراثيم وإيقاف نمو البكتيريا، مثل الإشريكية القولونية والشيغيلا.
- الحفاظ على صحة الفم: قد يمنع الزنجبيل نمو البكتيريا في الفم، مما يقلل خطر الإصابة بالتهابات اللثة.
- تخفيف الغثيان: يُستخدم لتخفيف اضطرابات المعدة والغثيان الناتج عن الحمل أو العلاج الكيميائي.
- تخفيف الالتهابات: يخفف ألم العضلات والتهابات المفاصل وهشاشة العظام مع الوقت.
- الحد من نمو السرطان: الجزيئات النشطة في الزنجبيل قد تمنع نمو أنواع مختلفة من السرطان.
- خفض السكر في الدم: قد يساعد الزنجبيل على تحسين استخدام الجسم للأنسولين.

2. فوائد الليمون:
- خفض خطر السكتات الدماغية: يحتوي على مركبات الفلافونويد التي تقلل خطر السكتة الدماغية.
- خفض ضغط الدم: قد يُساهم في خفض ضغط الدم.
- الحماية من السرطان: مضادات الأكسدة فيه تحارب الجذور الحرة المسببة للسرطان.
- تقليل نوبات الربو: استهلاك فيتامين ج يُقلل خطر الإصابة بنوبات الربو.
- تعزيز امتصاص الحديد: يحسن امتصاص الحديد من الطعام.
- تقوية المناعة: غني بفيتامين ج الذي يعزز مناعة الجسم.

3. فوائد العسل:
- مصدر لمضادات الأكسدة: تحمي الجسم من أمراض القلب والسرطان والشيخوخة.
- مضاد للجراثيم والفطريات: يحتوي على بيروكسيد الهيدروجين المضاد للجراثيم.
- غني بالمغذيات النباتية: تعمل كمضادات أكسدة ومضادة للسرطان وتقوي المناعة.
- علاج مشكلات الجهاز الهضمي: مفيد لعلاج الإسهال وقرحة المعدة ويغذي البكتيريا النافعة.
- تخفيف التهابات الحلق: يعمل كمهدئ للسعال ويخفف من التهابات الحلق بسرعة.
''',

      image: 'assets/assets/icons/png/4.png',
      category: "جمال",
      color: Color(0xFFf05e8e),
    ),
    Article(
      id: 6,
      title: ' تمارين رياضية لصحة القلب',
      body:
          'تُعد التمارين الرياضية من أهم الوسائل الطبيعية للحفاظ على صحة القلب والوقاية من الأمراض القلبية. إذ تساعد التمارين المنتظمة على تحسين الدورة الدموية، تقوية عضلة القلب، وخفض مستويات الكوليسترول الضار وضغط الدم. من أبرز التمارين المفيدة لصحة القلب: المشي السريع، فهو تمرين بسيط وآمن لمعظم الأعمار ويساهم في تحسين اللياقة البدنية. كذلك الركض وركوب الدراجة الهوائية يعززان قدرة القلب على ضخ الدم بكفاءة. أما السباحة، فهي تمرين متكامل للجسم كله وتخفف العبء على المفاصل مع تقوية القلب والرئتين. ينصح الأطباء بممارسة تمارين القلب لمدة لا تقل عن 150 دقيقة أسبوعيًا، مع توزيعها على عدة أيام. ومن المهم البدء بالتدريج وزيادة الشدة والمدة مع مرور الوقت. كما يجب استشارة الطبيب قبل بدء برنامج رياضي جديد خاصة لمن يعانون من مشكلات صحية. بالمداومة على التمارين الرياضية، لا يتحسن القلب فقط، بل يتحسن أيضًا المزاج، وتزداد مستويات الطاقة، مما ينعكس إيجابًا على جودة الحياة بشكل عام.',
      image: 'assets/assets/icons/png/5.png',
      category: "لياقة",
      color: Color(0xFFfccd0a),
    ),
    Article(
      id: 2,
      title: 'أهمية النوم لصحة الجسم',
      body: '''
يُعد النوم الجيد أحد أهم ركائز الصحة العامة، إذ يُساهم في تعزيز مناعة الجسم، وتحسين وظائف الدماغ، وتنظيم المزاج. يحتاج الإنسان البالغ إلى ما بين 7-9 ساعات من النوم يوميًا ليحافظ على صحته البدنية والنفسية. يؤثر نقص النوم سلبًا على القدرة على التركيز واتخاذ القرارات، كما يزيد من خطر الإصابة بأمراض القلب والسمنة والسكري.

خلال النوم، يقوم الجسم بإصلاح الخلايا التالفة، وإفراز الهرمونات التي تساهم في النمو وبناء العضلات، وتنظيم الشهية. كما يلعب النوم دورًا مهمًا في تعزيز الذاكرة وتنظيم المشاعر.

للحصول على نوم صحي، يُنصح بالالتزام بجدول نوم منتظم، وتجنب تناول الكافيين قبل النوم، وممارسة بعض الأنشطة المريحة مثل القراءة أو التأمل. كما يجب الاهتمام بتهيئة بيئة نوم مريحة ومظلمة وهادئة.

من خلال الاهتمام بجودة النوم، يمكن للجسم أن يحافظ على توازنه ويواجه الضغوطات اليومية بكفاءة أكبر، مما يُعزز الصحة العامة ويُحسن جودة الحياة.
''',
      image: 'assets/assets/icons/png/7.png',
      category: 'تغذية',
      color: Color(0xFFB4cf66),
    ),
  ];
}
