import 'package:flutter/material.dart';

class Article {
  final int id;
  final String title;
  final String body;
  final String image;
  final String category;
  final Color color;

  Article({
    required this.id,
    required this.title,
    required this.body,
    required this.image,
    required this.category,
    required this.color,
  });

  static List<Article> articles = [
    Article(
      id: 1,
      title: 'الصحّة والغذاء',
      body:
          'ترتبط الصحّة ارتباطاً مباشراً بالغذاء، فالتغذية السليمة، أساس الصحّة السليمة، لأنّ الغذاء هو الداء والدواء معاً، لذلك يجب على كل شخصٍ أن ينتبه لنوعيّة الطعام الذي يتناوله؛ لأنّ صحّة الجسم تعتمد على المجموعات الغذائيّة الأساسيّة التي تدخل إليه عن طريق الغذاء، كي يستطيع أن يقوم بمهامّه جميعاً، ويتمكن من إنتاج الطاقة، وهذه المجموعات هي مجموعة الفيتامينات، ومضادات الأكسدة، والمعادن، بالإضافة للبروتينات، والكربوهيدرات، والسكريات، والدهون كما أنّ صحّة جميع أعضاء الجسم، والتناغم الحاصل بينها، يعتمد على توازن المواد الأساسيّة التي يكتسبها من الغذاء الذي يتم تناوله، وهنا في هذا المقال سنذكر بعض النصائح ليبقَ الجسم قويّاً في مواجهة الأمراض',
      image:
          'https://images.unsplash.com/photo-1547496502-affa22d38842?q=80&w=1577&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D',
      category: 'تغذية',
      color: Color(0xFfB4cf66),
    ),

    Article(
      id: 2,
      title: 'أطعمة لتحسين المزاج',
      body:
          'يوجد عِدة أطعمة تُحسّن المزاج وتُقلل من الاكتئاب ومنها: المكسرات: تتميّز المُكسرات بِأنها غنية بالعناصر الغذائيّة وأهمها الألياف، والبروتين، والدهون الصحيّة مثل أوميغا3. ويُنصح بتناول أونصة واحدة أي ما يعادل 28 غرماً يومياً من المكسرات التي تحتوي على اللوز والجوز. لحوم الأبقار التي تتغذى على الأعشاب: تحتوي هذه اللحوم على عناصر غذائية عديدة أهمها البروتين الصحيّ عالي الجودة والدهون الصحيّة مثل الأوميغا3، التي تلعب دوراً في تقليل الاكتئاب وتحسين المزاج. الأسماك: يُعتبر السمك من أفضل الأغذية التي تُحارب الاكتئاب؛ لاحتوائها على مواد تحمل خصائص كمضادات للاكتئاب، ويُنصح بتناول 3 أونصات أي ما يُعادل 85 غراماً من السمك مرتين إلى 3 مرات خلال الإسبوع. الحبوب الكاملة: تُعتبر الحبوب الكاملة من الأطعمة الغنيّة بالألياف الغذائيّة؛ وذلك لدورها المهم في توازن معدلات السكر في الدم و تحسين المزاج عن طريق تنظيم إفراز النواقل العصبيّة في الدّماغ، لذا يُنصح بتناول 25 غراماً من الألياف للنساء و38 غراماً للرجال يوميّاً. الفواكة: يقل خطر الإصابة بالاكتئاب كُلّما زاد تناول الفواكة، وذلك بسبب احتوائها على العديد من الفيتامينات والمعادن. لِذا يُنصح بتناول نصف كوب إلى كوبين من الفواكة يوميّاً.',
      image:
          'https://images.unsplash.com/photo-1546069901-ba9599a7e63c?q=80&w=1480&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D',
      category: 'تغذية',
      color: Color(0xFfB4cf66),
    ),

    Article(
      id: 3,
      title: 'كيف نحمي انفسنا من مرض القلب',
      body: '''
لحماية أنفسنا من مرض القلب، من الضروري اتباع نمط حياة صحي يعتمد على التغذية السليمة والنشاط البدني المنتظم. يجب تناول الأطعمة الغنية بالألياف مثل الخضروات والفواكه، والتقليل من الدهون المشبعة والملح والسكر. كما يُفضل الابتعاد عن الأطعمة المصنعة والوجبات السريعة التي ترفع من مستوى الكوليسترول الضار في الجسم. من المهم أيضًا شرب كميات كافية من الماء والامتناع عن التدخين تمامًا.
إضافة إلى ذلك، يلعب النشاط البدني دورًا أساسيًا في الحفاظ على صحة القلب، لذلك يُنصح بممارسة الرياضة بانتظام، مثل المشي أو السباحة أو ركوب الدراجة لمدة لا تقل عن 30 دقيقة في اليوم. كذلك، يجب إدارة التوتر والضغوط النفسية من خلال تقنيات الاسترخاء أو التحدث مع الآخرين أو ممارسة الهوايات. من المهم أيضًا متابعة ضغط الدم ونسبة السكر والكوليسترول بشكل دوري للكشف المبكر عن أي مشاكل صحية واتخاذ التدابير المناسبة في الوقت المناسب.
''',
      image:
          'https://plus.unsplash.com/premium_photo-1722707492932-4cead104ce4a?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D',
      category: "صحة",
      color: Color(0xFF79bde8),
    ),
    Article(
      id: 4,
      title: 'فوائد الزنجبيل مع الليمون والعسل ',
      body: '''
يمتاز مزيج الزنجبيل مع الليمون والعسل بفوائد صحية عديدة، حيث يُعتبر مشروبًا طبيعيًا يساعد في تقوية المناعة ومكافحة نزلات البرد والإنفلونزا. يحتوي الزنجبيل على مركبات مضادة للالتهابات تساعد في تهدئة الحلق وتخفيف السعال، بينما يُعد الليمون مصدرًا غنيًا بفيتامين C الذي يعزز مناعة الجسم. أما العسل، فله خصائص مضادة للبكتيريا ويساهم في تلطيف الحلق وتحسين التئام الأنسجة.

كما يُساعد هذا المزيج في تحسين الهضم وتقليل الشعور بالغثيان، خاصة عند تناوله صباحًا على معدة فارغة. يمكن أن يُسهم أيضًا في تعزيز عملية حرق الدهون وتنشيط الدورة الدموية، مما يجعله خيارًا مناسبًا للأشخاص الذين يسعون للحفاظ على وزن صحي. بالإضافة إلى ذلك، قد يساعد على تقليل مستويات التوتر وتحسين المزاج بفضل خصائصه المهدئة والمغذية للجسم.''',
      image:
          'https://images.unsplash.com/photo-1563804447971-6e113ab80713?q=80&w=1374&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D',
      category: "جمال",
      color: Color(0xFFf05e8e),
    ),
    Article(
      id: 6,
      title: ' تمارين رياضية لصحة القلب',
      body:
          'تُعد التمارين الرياضية من أهم الوسائل الطبيعية للحفاظ على صحة القلب والوقاية من الأمراض القلبية. إذ تساعد التمارين المنتظمة على تحسين الدورة الدموية، تقوية عضلة القلب، وخفض مستويات الكوليسترول الضار وضغط الدم. من أبرز التمارين المفيدة لصحة القلب: المشي السريع، فهو تمرين بسيط وآمن لمعظم الأعمار ويساهم في تحسين اللياقة البدنية. كذلك الركض وركوب الدراجة الهوائية يعززان قدرة القلب على ضخ الدم بكفاءة. أما السباحة، فهي تمرين متكامل للجسم كله وتخفف العبء على المفاصل مع تقوية القلب والرئتين. ينصح الأطباء بممارسة تمارين القلب لمدة لا تقل عن 150 دقيقة أسبوعيًا، مع توزيعها على عدة أيام. ومن المهم البدء بالتدريج وزيادة الشدة والمدة مع مرور الوقت. كما يجب استشارة الطبيب قبل بدء برنامج رياضي جديد خاصة لمن يعانون من مشكلات صحية. بالمداومة على التمارين الرياضية، لا يتحسن القلب فقط، بل يتحسن أيضًا المزاج، وتزداد مستويات الطاقة، مما ينعكس إيجابًا على جودة الحياة بشكل عام.',
      image:
          'https://plus.unsplash.com/premium_photo-1667518251023-12d83d46bb8d?q=80&w=1409&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D',
      category: "لياقة",
      color: Color(0xFFfccd0a),
    ),
    Article(
      id: 7,
      title: 'أهمية النوم لصحة الجسم',
      body:
          '''يُعد النوم الجيد أحد أهم ركائز الصحة العامة، إذ يُساهم في تعزيز مناعة الجسم، وتحسين وظائف الدماغ، وتنظيم المزاج. يحتاج الإنسان البالغ إلى ما بين 7-9 ساعات من النوم يوميًا ليحافظ على صحته البدنية والنفسية. يؤثر نقص النوم سلبًا على القدرة على التركيز واتخاذ القرارات، كما يزيد من خطر الإصابة بأمراض القلب والسمنة والسكري.
    خلال النوم، يقوم الجسم بإصلاح الخلايا التالفة، وإفراز الهرمونات التي تساهم في النمو وبناء العضلات، وتنظيم الشهية. كما يلعب النوم دورًا مهمًا في تعزيز الذاكرة وتنظيم المشاعر.
    للحصول على نوم صحي، يُنصح بالالتزام بجدول نوم منتظم، وتجنب تناول الكافيين قبل النوم، وممارسة بعض الأنشطة المريحة مثل القراءة أو التأمل. كما يجب الاهتمام بتهيئة بيئة نوم مريحة ومظلمة وهادئة.
    من خلال الاهتمام بجودة النوم، يمكن للجسم أن يحافظ على توازنه ويواجه الضغوطات اليومية بكفاءة أكبر، مما يُعزز الصحة العامة ويُحسن جودة الحياة.
    ''',
      image:
          'https://images.unsplash.com/photo-1585128719715-46776b56a0d1?q=80&w=1374&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D',
      category: 'تغذية',
      color: Color(0xFfB4cf66),
    ),
  ];
}
